<?php

declare(strict_types=1);

// config for GoCPA/SpaceHealthcheck
return [

    /*
    |--------------------------------------------------------------------------
    | Healthcheck Secret Key
    |--------------------------------------------------------------------------
    */
    'secretKey' => env('GOCPASPACE_HEALTHCHECK_SECRET'),

    /*
    |--------------------------------------------------------------------------
    | ID проекта с GoCPA.Space
    |--------------------------------------------------------------------------
    */
    'projectId' => env('GOCPASPACE_HEALTHCHECK_PROJECT_ID'),

    /*
    |--------------------------------------------------------------------------
    | Путь к папке проекта на хостовой машине
    |--------------------------------------------------------------------------
    */
    'folder' => env('GOCPASPACE_HEALTHCHECK_FOLDER'),

    /*
    |--------------------------------------------------------------------------
    | Порт, если проект развёрнут в докере
    |--------------------------------------------------------------------------
    */
    'webserverExtPort' => env('WEBSERVER_EXT_PORT', env('APP_PORT')),
];
